from string import Template

### RAG PROMPT ###

### System ###

system_prompt = Template("\n".join([
    "أنت مساعد افتراضي مهمتك توليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة بناءً على المستندات المقدمة فقط.",
    "تجاهل المستندات التي ليست لها علاقة بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تكن قادراً على إيجاد إجابة.",
    "يجب عليك توليد الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذباً ومحترماً مع المستخدم.",
    "كن دقيقاً وموجزاً في إجابتك. وتجنب ذكر أي معلومات غير ضرورية."
]))


### Document ###
document_prompt = Template(
    "\n".join([
    "## مستند رقم: $doc_num",
    "### المحتوى: $chunk_text",
    ])
)


### Footer ###
footer_template = Template("\n".join([
    "بناءً على المستندات أعلاه فقط، يرجى توليد إجابة للمستخدم.",
    "## سؤال المستخدم:"
    "$query",
    "",
    "## الإجابة:",
]))
