from string import Template

### RAG PROMPT ###

### System ###

system_prompt = Template("\n".join([
    "أنت مساعد افتراضي مهمتك توليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة بناءً على المستندات المقدمة فقط.",
    "تجاهل المستندات التي ليست لها علاقة بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تكن قادراً على إيجاد إجابة.",
    "يجب عليك توليد الإجابة بنفس لغة سؤال المستخدم.",
    "$dialect_instruction",
    "كن مهذباً ومحترماً مع المستخدم.",
    "كن دقيقاً وموجزاً في إجابتك. وتجنب ذكر أي معلومات غير ضرورية."
]))


### Document ###
document_prompt = Template(
    "\n".join([
    "## مستند رقم: $doc_num",
    "### المحتوى: $chunk_text",
    ])
)


### Footer ###
footer_template = Template("\n".join([
    "بناءً على المستندات أعلاه فقط، يرجى توليد إجابة للمستخدم.",
    "## سؤال المستخدم:"
    "$query",
    "",
    "## الإجابة:",
]))

### Condense Question ###
condense_question_prompt = Template("\n".join([
    "بالنظر إلى سجل المحادثة التالي والسؤال الأخير للمستخدم،",
    "قم بصياغة سؤال مستقل وواضح يمكن فهمه بدون الحاجة لسجل المحادثة.",
    "لا تجب على السؤال، بل أعد صياغته فقط إذا لزم الأمر.",
    "إذا كان السؤال واضحاً ومستقلاً بالفعل، أرجعه كما هو.",
    "",
    "## سجل المحادثة:",
    "$chat_history",
    "",
    "## السؤال الأخير:",
    "$query",
    "",
    "## السؤال المستقل:"
]))
